Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxDam_bf.h
/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN57 */
#define IFX_DAM_RGNACCEN_RB_EN57_OFF (25u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN58 */
#define IFX_DAM_RGNACCEN_RB_EN58_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN58 */
#define IFX_DAM_RGNACCEN_RB_EN58_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN58 */
#define IFX_DAM_RGNACCEN_RB_EN58_OFF (26u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN59 */
#define IFX_DAM_RGNACCEN_RB_EN59_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN59 */
#define IFX_DAM_RGNACCEN_RB_EN59_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN59 */
#define IFX_DAM_RGNACCEN_RB_EN59_OFF (27u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN60 */
#define IFX_DAM_RGNACCEN_RB_EN60_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN60 */
#define IFX_DAM_RGNACCEN_RB_EN60_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN60 */
#define IFX_DAM_RGNACCEN_RB_EN60_OFF (28u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN61 */
#define IFX_DAM_RGNACCEN_RB_EN61_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN61 */
#define IFX_DAM_RGNACCEN_RB_EN61_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN61 */
#define IFX_DAM_RGNACCEN_RB_EN61_OFF (29u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN62 */
#define IFX_DAM_RGNACCEN_RB_EN62_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN62 */
#define IFX_DAM_RGNACCEN_RB_EN62_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN62 */
#define IFX_DAM_RGNACCEN_RB_EN62_OFF (30u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN63 */
#define IFX_DAM_RGNACCEN_RB_EN63_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN63 */
#define IFX_DAM_RGNACCEN_RB_EN63_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN63 */
#define IFX_DAM_RGNACCEN_RB_EN63_OFF (31u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXDAM_BF_H */
